app/controllers/combat_logs_controller.rb

  def index
    @combat_logs = CombatLog.all
---
SELECT "combat_logs".* FROM "combat_logs"

  def show
    @combat_log = CombatLog.find(params[:id])
---
SELECT "combat_logs".* FROM "combat_logs" WHERE "combat_logs"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @combat_log = CombatLog.new(params[:combat_log])

    respond_to do |format|
      if @combat_log.save
---
INSERT INTO "combat_logs" ("created_at", "filename", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 25 Mar 2012 22:13:21 UTC +00:00], ["filename", nil], ["updated_at", Sun, 25 Mar 2012 22:13:21 UTC +00:00]]

  def destroy
    @combat_log = CombatLog.find(params[:id])
    @combat_log.destroy
---
SELECT "combat_logs".* FROM "combat_logs" WHERE "combat_logs"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "combat_logs" WHERE "combat_logs"."id" = ?  [["id", 1]]